code-review/NRB_3471_3546/База_Стало/Reports/ЖурналВходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЖурналВходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьДокументОснование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ПаспортныеДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПаспортныеДанныеФизЛиц</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДокументВид</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыУдостоверяющиеЛичность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ОткрытиеСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОткрытиеСчетаДепо</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выписка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Выписка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДепозитарногоДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СлужебноеПоручение</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДепозитарногоДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/ВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыОпераций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КлассОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнглийскоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДвижениеПоЦБ</Name>
					<Comment>Включает движения по регистрам ОстаткиЦБДепозитарийМХ и ОстаткиЦБМестоРасчетов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыплатаДоходаВДенежнойФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомплектДокументов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОперацииИФИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Reports/ЖурналВходящихДокументов/Ext/ObjectModule.bsl
// Процедура выполняет замену ключей текста запроса на корректный текст компиляции
Процедура ВыполнитьОбработкуИЗаменуТекстаЗапроса(Запрос)
	ТекстЗапроса     = Запрос.Текст;
	ПараметрыЗапроса = Запрос.Параметры;
	
	ИспользоватьОтборыСПД = Ложь;
	Если УстановленОтборПо("Депонент", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ДепонентВидСравнения,
			"&Депонент", "Журнал.Депонент",,, ПараметрыЗапроса.Депонент);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДепоненту", СтрокаОтбора);
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ДепонентВидСравнения,
			"&Депонент", "иц_СводноеПоручениеСоставПоручения.Депонент",,, ПараметрыЗапроса.Депонент); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборСПДПоДепоненту", СтрокаОтбора);
		ИспользоватьОтборыСПД = Истина;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоДепоненту", "Истина");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборСПДПоДепоненту", "Истина");
	КонецЕсли;
	
	Если УстановленОтборПо("ЦеннаяБумага", ПараметрыЗапроса) Тогда
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ЦеннаяБумагаВидСравнения,
			"&ЦеннаяБумага", "Журнал.ЦеннаяБумага",,, ПараметрыЗапроса.ЦеннаяБумага);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоЦеннойБумаге", СтрокаОтбора);
		СтрокаОтбора = УправлениеОтчетами.ПолучитьСтрокуОтбора(ПараметрыЗапроса.ЦеннаяБумагаВидСравнения,
			"&ЦеннаяБумага", "иц_СводноеПоручениеСоставПоручения.ЦеннаяБумага",,, ПараметрыЗапроса.ЦеннаяБумага); 
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборСПДПоЦеннойБумаге", СтрокаОтбора);
		ИспользоватьОтборыСПД = Истина;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборПоЦеннойБумаге", "Истина");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ОтборСПДПоЦеннойБумаге", "Истина");
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИспользоватьОтборыСПД", ?(ИспользоватьОтборыСПД, "Истина", "Ложь"));
	Запрос.Текст = ТекстЗапроса;
КонецПроцедуры

Процедура ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос)
	сзПараметрыЗапроса = Новый СписокЗначений;
	сзПараметрыЗапроса.Добавить("Депонент");
	сзПараметрыЗапроса.Добавить("ЦеннаяБумага");
	
	Для Каждого элПарам Из сзПараметрыЗапроса Цикл
		Запрос.УстановитьПараметр(элПарам.Значение,					Неопределено);
		Запрос.УстановитьПараметр(элПарам.Значение+"ВидСравнения",	Неопределено);
		Запрос.УстановитьПараметр(элПарам.Значение+"Использование",	Ложь);
	КонецЦикла;	 

	// Заполним структуру параметров на основании данных отбора
	ЭлементыОтбора = КомпоновщикНастроек.Настройки.Отбор.Элементы;
		
	Для Каждого Эл Из ЭлементыОтбора Цикл
		Если Эл.Использование Тогда
			
			ИмяПараметра1 = СокрЛП(эл.ЛевоеЗначение);
			ИмяПараметра2 = СокрЛП(эл.ЛевоеЗначение)+"ВидСравнения";
			ИмяПараметра3 = СокрЛП(эл.ЛевоеЗначение)+"Использование";
			
			Если Запрос.Параметры.Свойство(ИмяПараметра1) Тогда
				Запрос.Параметры[ИмяПараметра1] = эл.ПравоеЗначение;
			КонецЕсли;
			
			Если Запрос.Параметры.Свойство(ИмяПараметра2) Тогда
				Запрос.Параметры[ИмяПараметра2] = эл.ВидСравнения;
				
			КонецЕсли;
			
			Если Запрос.Параметры.Свойство(ИмяПараметра3) Тогда
				Запрос.Параметры[ИмяПараметра3] = эл.Использование;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Возвращает результат запроса к БД
Функция СформироватьЗапрос() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДатаНачала",					НачалоДня(ДатаНач));
	Запрос.УстановитьПараметр("ДатаОкончания",				КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("КлассОперацийГлобальные",	Перечисления.КлассыОпераций.Глобальные);
	ЗаполнитьПараметрыЗапросаПоОтборуСКД(Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	иц_СводноеПоручениеСоставПоручения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СПДПоОтборам
	|ИЗ
	|	Документ.иц_СводноеПоручение.СоставПоручения КАК иц_СводноеПоручениеСоставПоручения
	|ГДЕ
	|	&ОтборСПДПоЦеннойБумаге
	|	И &ОтборСПДПоДепоненту
	|	И иц_СводноеПоручениеСоставПоручения.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И &ИспользоватьОтборыСПД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Журнал.НомерДокумента КАК НомерДокумента,
	|	Журнал.Период КАК ДатаДокумента,
	|	Журнал.НаименованиеДокументаИлиКомплекта КАК НаименованиеДокументаИлиКомплекта,
	|	Журнал.ИсходящийНомер КАК ИсходящийНомер,
	|	Журнал.ДатаОтправления КАК ДатаОтправления,
	|	Журнал.Депонент КАК Депонент,
	|	Журнал.Депонент.Код КАК КодДепонента,
	|	Журнал.ЦеннаяБумага КАК ЦеннаяБумага,
	|	Журнал.ЦеннаяБумага.Наименование + "" / "" + Журнал.ЦеннаяБумага.ISIN КАК НаименованиеISINЦБ,
	|	Журнал.ЛицоНаправившееДокумент КАК ЛицоНаправившееДокумент,
	|	Журнал.Исполнитель КАК Исполнитель,
	|	Журнал.Комментарий КАК Комментарий,
	|	Журнал.Основание КАК Основание,
	|	ВЫРАЗИТЬ(Журнал.Основание КАК Документ.Поручение).ВидОперацииД КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(Журнал.Основание КАК Документ.Поручение).ВидОперацииД.КлассОпераций = &КлассОперацийГлобальные
	|				И ВЫРАЗИТЬ(Журнал.Основание КАК Документ.Поручение).ВидОперацииД.ВыплатаДоходаВДенежнойФорме
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоИзвещениеОВыплате,
	|	ВЫБОР
	|		КОГДА НЕ ОткрытиеСчетаДепо.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЕСТЬNULL(ОткрытиеСчетаДепо.СчетДепо.НомерДепозитарногоДоговора, """")
	|		КОГДА НЕ ОткрытиеРазделаСчетаДепо.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЕСТЬNULL(ОткрытиеРазделаСчетаДепо.СчетДепо.НомерДепозитарногоДоговора, """")
	|		КОГДА НЕ НазначениеПредставителяСчетаДепо.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЕСТЬNULL(НазначениеПредставителяСчетаДепо.СчетДепо.НомерДепозитарногоДоговора, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДепозитарногоДоговора,
	|	ВЫБОР
	|		КОГДА НЕ ОткрытиеСчетаДепо.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЕСТЬNULL(ОткрытиеСчетаДепо.СчетДепо.ДатаЗаключенияДепозитарногоДоговора, ДАТАВРЕМЯ(1, 1, 1))
	|		КОГДА НЕ ОткрытиеРазделаСчетаДепо.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЕСТЬNULL(ОткрытиеРазделаСчетаДепо.СчетДепо.ДатаЗаключенияДепозитарногоДоговора, ДАТАВРЕМЯ(1, 1, 1))
	|		КОГДА НЕ НазначениеПредставителяСчетаДепо.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЕСТЬNULL(НазначениеПредставителяСчетаДепо.СчетДепо.ДатаЗаключенияДепозитарногоДоговора, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаДепозитарногоДоговора
	|ИЗ
	|	РегистрСведений.ЖурналВходящихДокументов КАК Журнал
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОткрытиеСчетаДепо КАК ОткрытиеСчетаДепо
	|		ПО (ОткрытиеСчетаДепо.ДокументОснование = Журнал.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОткрытиеРазделаСчетаДепо КАК ОткрытиеРазделаСчетаДепо
	|		ПО (ОткрытиеРазделаСчетаДепо.ДокументОснование = Журнал.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.НазначениеПредставителяСчетаДепо КАК НазначениеПредставителяСчетаДепо
	|		ПО (НазначениеПредставителяСчетаДепо.ДокументОснование = Журнал.Основание)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СПДПоОтборам КАК СПДПоОтборам
	|		ПО Журнал.Основание = СПДПоОтборам.Ссылка
	|ГДЕ
	|	Журнал.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (&ОтборПоДепоненту
	|				И &ОтборПоЦеннойБумаге
	|			ИЛИ НЕ СПДПоОтборам.Ссылка ЕСТЬ NULL )
	|
	|УПОРЯДОЧИТЬ ПО
	|	Журнал.Период,
	|	Журнал.Основание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Журнал.Основание КАК Основание,
	|	иц_СводноеПоручениеСоставПоручения.ЦеннаяБумага.ISIN КАК ISIN,
	|	иц_СводноеПоручениеСоставПоручения.ЦеннаяБумага.Ссылка КАК ЦБ
	|ИЗ
	|	РегистрСведений.ЖурналВходящихДокументов КАК Журнал
	|		ЛЕВОЕ СОЕДИНЕНИЕ СПДПоОтборам КАК СПДПоОтборам
	|		ПО Журнал.Основание = СПДПоОтборам.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.иц_СводноеПоручение.СоставПоручения КАК иц_СводноеПоручениеСоставПоручения
	|		ПО Журнал.Основание = иц_СводноеПоручениеСоставПоручения.Ссылка
	|ГДЕ
	|	Журнал.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И (&ОтборПоДепоненту
	|				И &ОтборПоЦеннойБумаге
	|			ИЛИ НЕ СПДПоОтборам.Ссылка ЕСТЬ NULL )
	|	И Журнал.Основание ССЫЛКА Документ.иц_СводноеПоручение
	|
	|УПОРЯДОЧИТЬ ПО
	|	иц_СводноеПоручениеСоставПоручения.ЦеннаяБумага.Наименование,
	|	иц_СводноеПоручениеСоставПоручения.ЦеннаяБумага.ISIN";
	ВыполнитьОбработкуИЗаменуТекстаЗапроса(Запрос);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Возврат РезультатЗапроса;
КонецФункции

// Возвращает структуру параметров шапки макета
Функция СформироватьПараметрыШапкиМакета() Экспорт
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ДтНач", Формат(ДатаНач, "ДФ=dd.MM.yyyy"));
	СтруктураВозврата.Вставить("ДтКон", Формат(ДатаКон, "ДФ=dd.MM.yyyy"));
	Возврат СтруктураВозврата;
КонецФункции
    
// Очищает значения параметров области макета
Процедура ОчиститьЗначенияПараметровМакета(ПараметрыМакета) Экспорт
	Для Инд = 0 По (ПараметрыМакета.Количество()-1) Цикл
		ПараметрыМакета.Установить(Инд, Неопределено);
	КонецЦикла;
КонецПроцедуры	

Процедура СформироватьОтчет(Таблица) Экспорт
	
	ОперацииОткрытия = Новый Массив;
	ОперацииОткрытия.Добавить(Справочники.ВидыОпераций.ОткрытиеСчетаДепо);
	ОперацииОткрытия.Добавить(Справочники.ВидыОпераций.ОткрытиеРазделаСчетаДепо);
	
	ОперацииНазначения = Новый Массив;
	ОперацииНазначения.Добавить(Справочники.ВидыОпераций.НазначениеОператораСчетаДепо);
	
	РезультатЗапроса = СформироватьЗапрос();
	Если РезультатЗапроса[1].Пустой() Тогда
		Сообщить("Данные для формирования отчета не обнаружены!");
		Возврат;
	КонецЕсли;
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьЗаголовок		= Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаОснование	= Макет.ПолучитьОбласть("Шапка|Основание");
	ОбластьШапкаОтчет		= Макет.ПолучитьОбласть("Шапка|Отчет");
	ОбластьСтрокаОснование	= Макет.ПолучитьОбласть("Строка|Основание");
	ОбластьСтрокаОтчет		= Макет.ПолучитьОбласть("Строка|Отчет");
	ОбластьПодвалОснование	= Макет.ПолучитьОбласть("Подвал|Основание");
	ОбластьПодвалОтчет		= Макет.ПолучитьОбласть("Подвал|Отчет");

	// ЗАГОЛОВОК
	СтруктураЗаголовка = СформироватьПараметрыШапкиМакета();
	ОбластьЗаголовок.Параметры.Заполнить(СтруктураЗаголовка);
	Таблица.Вывести(ОбластьЗаголовок);
	
	// ШАПКА
	Если ПоказыватьДокументОснование Тогда
		Таблица.Вывести(ОбластьШапкаОснование);
		Таблица.Присоединить(ОбластьШапкаОтчет);
	Иначе
		Таблица.Вывести(ОбластьШапкаОтчет);
	КонецЕсли;
	
	РасшифровкаЦБПоСПД = РезультатЗапроса[2].Выгрузить();
	Выборка = РезультатЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		// СТРОКА ОТЧЕТА
		
		// Заполнение параметров строки
		ОчиститьЗначенияПараметровМакета(ОбластьСтрокаОтчет.Параметры);
		ЗаполнитьЗначенияСвойств(ОбластьСтрокаОтчет.Параметры, Выборка);
		
		ОбластьСтрокаОтчет.Параметры.НаименованиеЮрФизЛицаКлиента = ОбщегоНазначенияКлиентСервер.НаименованиеЮрФизЛицаКлиента(
			Выборка.Депонент, Выборка.ДатаДокумента, Ложь);
		Если ТипЗнч(Выборка.Депонент) = Тип("СправочникСсылка.Контрагенты") Тогда
			ОбластьСтрокаОтчет.Параметры.ИдентифицирующийПризнакДепонента = ДокументКлиентаСРегНомером(
				Выборка.Депонент, Выборка.ДатаДокумента);
		Иначе
			ОбластьСтрокаОтчет.Параметры.ИдентифицирующийПризнакДепонента = "";
			ОбластьСтрокаОтчет.Параметры.КодДепонента = "";
		КонецЕсли;
		
		Если Выборка.НаименованиеДокументаИлиКомплекта = "Поручение" Тогда
			Если ОперацииОткрытия.Найти(Выборка.ВидОперации) <> Неопределено Тогда
				ОбластьСтрокаОтчет.Параметры.НаименованиеДокументаИлиКомплекта = Выборка.НаименованиеДокументаИлиКомплекта
				+ "/Депозитарный договор №"	+ СокрЛП(Выборка.НомерДепозитарногоДоговора)
				+ " от " + Формат(Выборка.ДатаДепозитарногоДоговора, "ДЛФ=Д");
				
			ИначеЕсли ОперацииНазначения.Найти(Выборка.ВидОперации) <> Неопределено Тогда
				ОбластьСтрокаОтчет.Параметры.НаименованиеДокументаИлиКомплекта = Выборка.НаименованиеДокументаИлиКомплекта
				+ "/Договор обслуживания на финансовых рынках №" + СокрЛП(Выборка.НомерДепозитарногоДоговора)
				+ " от " + Формат(Выборка.ДатаДепозитарногоДоговора, "ДЛФ=Д");
				
			ИначеЕсли Выборка.ЭтоИзвещениеОВыплате Тогда
				ОбластьСтрокаОтчет.Параметры.НаименованиеДокументаИлиКомплекта = "Извещение о выплате и перечислении денежных средств";
			КонецЕсли;
		КонецЕсли;
		
		Если ТипЗнч(Выборка.Основание) = Тип("ДокументСсылка.иц_СводноеПоручение") Тогда
			ТекстЦенныеБумагиСПД = "";
			ДанныеЦБПоСПД = РасшифровкаЦБПоСПД.НайтиСтроки(Новый Структура("Основание", Выборка.Основание));
			Для Каждого ДанныеЦБ Из ДанныеЦБПоСПД Цикл
				ТекстЦенныеБумагиСПД = ТекстЦенныеБумагиСПД + ДанныеЦБ.ЦБ+" / " + ДанныеЦБ.ISIN+";"+ Символы.ПС;
			КонецЦикла;
			ОбластьСтрокаОтчет.Параметры.НаименованиеISINЦБ = ТекстЦенныеБумагиСПД;
			ОбластьСтрокаОтчет.Параметры.ЦеннаяБумага = Выборка.Основание;
		КонецЕсли;
		
		Если ПоказыватьДокументОснование Тогда
			ОбластьСтрокаОснование.Параметры.Основание = Выборка.Основание;
			
			Таблица.Вывести(ОбластьСтрокаОснование);
			Таблица.Присоединить(ОбластьСтрокаОтчет);
		Иначе
			Таблица.Вывести(ОбластьСтрокаОтчет);
		КонецЕсли;
	КонецЦикла;
	
	// ПОДВАЛ ОТЧЕТА
	Если ПоказыватьДокументОснование Тогда
		Таблица.Вывести(ОбластьПодвалОснование);
		Таблица.Присоединить(ОбластьПодвалОтчет);
	Иначе
		Таблица.Вывести(ОбластьПодвалОтчет);
	КонецЕсли;
	
	// Установим ширину колонок
	УстановитьШиринуКолонки(Таблица, 1, 14);	// Номер документа
	УстановитьШиринуКолонки(Таблица, 2, 16);	// Дата и время регистрации документа
	УстановитьШиринуКолонки(Таблица, 3, 34);	// Наименование документа / комплекта документов
	УстановитьШиринуКолонки(Таблица, 4, 16);	// Уникальный номер документа / Исх. номер(при наличии)
	УстановитьШиринуКолонки(Таблица, 5, 11);	// Дата отправления (при наличии)
	УстановитьШиринуКолонки(Таблица, 7, 9);		// Код депонента
	УстановитьШиринуКолонки(Таблица, 8, 50);	// Идентифицирующий признак Депонента
КонецПроцедуры

Процедура УстановитьШиринуКолонки(Таблица, НомерКолонкиБезДокументаОснования, Ширина)
	мНомерКолонки = ?(ПоказыватьДокументОснование, НомерКолонкиБезДокументаОснования + 1, НомерКолонкиБезДокументаОснования);
	мКолонка = Таблица.Область(, мНомерКолонки,, мНомерКолонки);
	мКолонка.ШиринаКолонки = Ширина;
КонецПроцедуры

функция ДокументКлиентаСРегНомером(Клиент, ДатаДокумента)
	Результат = "";
	Если ТипЗнч(Клиент) = Тип("СправочникСсылка.Контрагенты") И ЗначениеЗаполнено(Клиент.ЮридическиеФизическиеЛица) Тогда
		Если Клиент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда
			Результат = КодИдентифицирующийЮрЛицо(Клиент.ЮридическиеФизическиеЛица);
		Иначе	
			Результат = ОбщегоНазначенияКлиентСервер.ДокументКлиента(Клиент, ДатаДокумента);
			
			// Если на дату документа нет данных, берем первую запись
			Если НЕ ЗначениеЗаполнено(Результат) Тогда
				Отбор = Новый Структура("ФизЛицо", Клиент.ЮридическиеФизическиеЛица);
				Паспорт = РегистрыСведений.ПаспортныеДанныеФизЛиц.ПолучитьПервое(ДатаДокумента, Отбор);
				Если ЗначениеЗаполнено(Паспорт.ДокументВид) Тогда
					Результат = Справочники.ФизическиеЛица.ДокументУдостоверяющийЛичность(Паспорт);
				Иначе
					Результат = "";
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Для физ.лица "+Клиент.ЮридическиеФизическиеЛица+" нет данных о документе!";
					Сообщение.Сообщить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция КодИдентифицирующийЮрЛицо(ЮрЛицоСсылка)
	Если ЗначениеЗаполнено(ЮрЛицоСсылка) Тогда
		ЮрЛицо = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЮрЛицоСсылка, "Страна, ОГРН, РегНомер, ИНН, TIN");
		ЭтоРезидент = (ЮрЛицо.Страна = Справочники.КлассификаторСтранМира.РОССИЯ);
		Если ЗначениеЗаполнено(ЮрЛицо.ОГРН) Тогда
			Результат = ?(ЭтоРезидент, "ОГРН ", "") + ЮрЛицо.ОГРН;
		ИначеЕсли ЗначениеЗаполнено(ЮрЛицо.РегНомер) Тогда
			Результат = "Рег.номер " + ЮрЛицо.РегНомер;
		ИначеЕсли Не ЭтоРезидент И ЗначениеЗаполнено(ЮрЛицо.ИНН) Тогда
			Результат = "ИНН " + ЮрЛицо.ИНН;
		ИначеЕсли Не ЭтоРезидент И ЗначениеЗаполнено(ЮрЛицо.TIN) Тогда
			Результат = "TIN " + ЮрЛицо.TIN;
		Иначе
			Результат = "";
		КонецЕсли;
	Иначе
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция УстановленОтборПо(ИмяПараметра, ПараметрыЗапроса)
	Возврат ЗначениеЗаполнено(ПараметрыЗапроса[ИмяПараметра]) И ПараметрыЗапроса[ИмяПараметра+"Использование"] = Истина; 
КонецФункции

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
